CSI API ETABS v1

# cSapModelPropLink Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropLink PropLink { get; }

    ReadOnly Property PropLink As cPropLink
    	Get

    Dim instance As cSapModel
    Dim value As cPropLink

    value = instance.PropLink

    property cPropLink^ PropLink {
    	cPropLink^ get ();
    }

    abstract PropLink : cPropLink with get

#### Property Value

Type: cPropLink

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com